Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Please consult the appropriate module documentation and any documentation for your platform (like L<perlsolaris>, L<perllinux>, L<perlmacosx>, L<perlwin32>, etc) for variables peculiar to those specific situations.
ru_ru: Пожалуйста, обратитесь к соответствующей документации модуля и любую документацию для вашей платформы (например, L<perlsolaris>, L<perllinux>, L<perlmacosx>, L<perlwin32>, И т.д.) для переменных характерна для тех конкретных ситуациях.

source: Please keep in mind that many of them are code fragments rather than complete programs.
ru_ru: Пожалуйста, имейте в виду, что многие из них являются фрагментами кода, а не полными программами.

source: Precede any character that needs to be protected, like a space or backslash, with another backslash.
ru_ru: Предшествовать любой символ, который нуждается в защите, как и пространство или обратную косую черту, с другой косой чертой.

source: Prints out a brief B<h>elp message.
ru_ru: Выводит справочную информацию по использованию (B<h>elp).

source: Prints to STDOUT the value of the named configuration variable(s), with multiples when your C<I<configvar>> argument looks like a regex (has non-letters).
ru_ru: Печатает на стандартный вывод (STDOUT) значение указанной переменной конфигурации или несколько переменных, если ваш C<I<configvar>> аргумент выглядит как регулярное выражение (содержит небуквы).

source: Put
ru_ru: Устанавливает

source: Quantifiers can be used to specify how many of the previous thing you want to match on, where "thing" means either a literal character, one of the metacharacters listed above, or a group of characters or metacharacters in parentheses.
ru_ru: Квантификаторы (умножители) могут быть использованы для указания, сколько из предыдущего, что вы хотите, чтобы соответствовать на, где "вещь" означает либо буквенный символ, один из метасимволов, перечисленных выше, или группа символов или метасимволы в круглых скобках.

source: Read L<perlootut> and L<perlobj>.
ru_ru: Читайте L<perlootut> и L<perlobj>.

source: Read all about it (and other special variables) in L<perlvar>.
ru_ru: Читайте об этом (и других специальных переменных) в L<perlvar>.

source: Read all about them in L<perlrequick>, L<perlretut>, and L<perlre>.
ru_ru: Прочитайте все о них в L<perlrequick>, L<perlretut>, and L<perlre>.

source: Reading in the whole file at one time is called slurping.
ru_ru: Чтение в файла целиком за один раз, называется slurping хлебать (съесть целиком).

source: Recursive search.
ru_ru: Рекурсивный поиск.

source: Relevant only if Perl is compiled with the C<malloc> included with the Perl distribution; that is, if C<perl -V:d_mymalloc> is "define".
ru_ru: Релевантно только в Perl скомпилирован с C<malloc> входит в Perl распределения, то есть, если C<perl -V:d_mymalloc> будет "определен".

source: Relevant only if your Perl executable was built with B<-DDEBUGGING>, this controls the behaviour of global destruction of objects and other references.
ru_ru: Соответствующие только если ваш Perl исполняемый был построен с B<-DDEBUGGING>, это управляет поведением глобального уничтожения объектов и др. Ссылки.

source: Repeating letters is just redundant, not cumulative nor toggling.
ru_ru: Повторение букв избыточно, не суммируются, не переключения.

source: Run C<perldoc perldoc> to learn more things you can do with F<perldoc>.
ru_ru: Запустите С<perldoc perldoc> чтобы узнать больше возможностей, которые вы можете сделать с F<perldoc> .

source: Scalar values can be strings, integers or floating point numbers, and Perl will automatically convert between them as required.
ru_ru: Скалярные значения могут быть строки, целые числа или числа с плавающей точкой, а также Perl автоматически преобразует между ними по мере необходимости.

source: Scalar values can be used in various ways:
ru_ru: Скалярные значения могут быть использованы в различных формах:

source: Scalars, arrays and hashes are documented more fully in L<perldata>.
ru_ru: Скаляры, массивы и хэши описаны более полно в L<perldata> .

source: Scripts that refer to the special variables RSTART and RLENGTH can often be simplified by referring to the variables $`, $& and $', as long as they are within the scope of the pattern match that sets them.
ru_ru: Сценарии, которые относятся к специальным переменным RSTART и RLENGTH часто могут быть упрощены путем ссылки на переменные $ `, $ & и $ ', пока они находятся в пределах поиска по шаблону, который устанавливает их.

source: Second, it assigns C<$\> (the output record separator) to have the value of I<octnum> so that any print statements will have that separator added back on.
ru_ru: Во-вторых, он присваивает C<$\> (разделителю выходных записей), чтобы иметь значение I<octnum> (I<восьмиричное число>) так что любые операторы печати будут иметь разделитель выданный обратно (will have that separator added back on).

source: See L<perlipc/"Deferred Signals (Safe Signals)">.
ru_ru: См. L<perlipc/"Deferred Signals (Safe Signals)" (Отложенные сигналы (Безопасные сигналы))>.

source: See L<perlsec> for details.
ru_ru: См. L<perlsec> для деталей.

source: See L<perlsyn/"Switch Statements"> for more details.
ru_ru: См. L<perlsyn/"Switch Statements"> для более подробной информации.

source: See L<perlop> for possible security implications.
ru_ru: См. L<perlop> за возможные последствия для безопасности.

source: See C<L<perlsyn/"Foreach Loops">>.
ru_ru: См. C<L<perlsyn/"Foreach Loops">>.

source: See C<perldoc --help> (or C<perldoc perldoc> or C<man perldoc>) for other helpful options L<perldoc> has to offer.
ru_ru: См. C<perldoc --help> (или C<perldoc perldoc> или C<man perldoc>) для других полезных вариантов, которые L<perldoc> может предложить.

source: See L<"open pragma"|open> for how to add external encodings as defaults.
ru_ru: См. L<"open pragma"|open>, как добавить внешнюю кодировку по умолчанию.

source: See L</-p> to have lines printed.
ru_ru: См. L</-p> чтобы иметь напечатанные строки.

source: See L<Location of Perl>.)
ru_ru: См. L<Location of Perl>.)

source: See L<POD2::IT> (or L<POD2::FR>) to see how to create new localized C<POD2::*> documentation packages and integrate them into L<Pod::Perldoc>.
ru_ru: Смотрите L<POD2::IT> (или L<POD2::FR>, или L<POD2::LT>, или L<POD2::RU>) в порядке появления и интеграции новой локализации C<POD2::*> документации в L<Pod::Perldoc>.

source: See L<feature>.
ru_ru: См. L<feature>.

source: See L<perldebug> for details and variations.
ru_ru: См. L<perldebug> для деталей и вариаций.

source: See L<perldebug>.
ru_ru: См. L<perldebug>.

source: See L<perldiag> for explanations of all Perl's diagnostics.
ru_ru: См. L<perldiag> за разъяснениями всех сообщений диагностики Perl.

source: See L<perlhacktips/PERL_DESTRUCT_LEVEL> for more information.
ru_ru: See L<perlhacktips/PERL_DESTRUCT_LEVEL> для получения дополнительной информации.

source: See L<perlport/"Supported Platforms"> for a listing.
ru_ru: См. L<perlport/"Supported Platforms"> для ознакомления с перечнем.

source: See L<perlrun>.
ru_ru: См. L<perlrun>.

source: See L<perlsec/"Algorithmic Complexity Attacks"> and L</PERL_HASH_SEED> and L</PERL_HASH_SEED_DEBUG> for more information.
ru_ru: См. L<perlsec/"Algorithmic Complexity Attacks"> и L</PERL_HASH_SEED> и L</PERL_HASH_SEED_DEBUG> для получения дополнительной информации.

source: See L<perlsec/"Algorithmic Complexity Attacks"> and L</PERL_PERTURB_KEYS> L</PERL_HASH_SEED_DEBUG> for more information.
ru_ru: См. L<perlsec/"Algorithmic Complexity Attacks"> and L</PERL_PERTURB_KEYS> L</PERL_HASH_SEED_DEBUG> для получения дополнительной информации.

source: See L<perlsec>.
ru_ru: См. L<perlsec>.

source: See also C<hash_seed()> and C<key_traversal_mask()> in L<Hash::Util>.
ru_ru: См. также C<hash_seed()> и C<key_traversal_mask()> в L<Hash::Util>.

source: See also L<perldiag> and L<perltrap>.
ru_ru: См. также L<perldiag> и L<perltrap>.

source: See below for more description of the switches.
ru_ru: Подробная информация о параметрах командной строки ниже.

source: See the Camel Book for why.
ru_ru: См. Camel Book почему.

source: See the F<INSTALL> file in the Perl source distribution for how to do this.
ru_ru: См. F<INSTALL> файл в исходных файлах Perl'а, как это сделать.

source: See the description of the B<-C> switch for more information.
ru_ru: См. описание B<-C> переключатель получить дополнительные сведения.

source: See the list of operators in the next section for information on comparison and boolean logic operators, which are commonly used in conditional statements.
ru_ru: См. список операторов в следующем разделе для получения информации о сравнениях и логических операторах, которые обычно используются в условных операторах.

source: Set to 1 to allow the use of non-IFS compatible LSPs (Layered Service Providers).
ru_ru: Установите 1, чтобы разрешить использование не-IFS LSP, совместимы (многоуровневые службы).

source: Set to C<"1"> to have Perl resolve I<all> undefined symbols when it loads a dynamic library.
ru_ru: Установите в C<"1"> иметь Perl решения я <all> неопределенных символов при загрузке динамической библиотеки.

source: Setting this environment variable to 1 means that Perl will simply use the first suitable LSP enumerated in the catalog, which keeps I<McAfee Guardian> happy--and in that particular case Perl still works too because I<McAfee Guardian>'s LSP actually plays other games which allow applications requiring IFS compatibility to work.
ru_ru: Установка этой переменной среды 1 означает, что Perl просто будет использовать только первый подходящий LSP перечисленных в каталоге, который держит I<McAfee Guardian> счастливым - и в этом конкретном случае Perl все еще работает, потому что я слишком I<McAfee Guardian> на самом деле играет LSP других игр, которые позволяют приложениям IFS требующих совместимости на работу.

source: Setting this to C<"1"> is not the right way to "enable Unicode" (whatever that would mean).
ru_ru: Установка этого значения в C<"1"> не правильный путь, чтобы "включить Unicode" (что бы это означало бы).

source: Setting this variable is useful during testing of extensions, as it ensures that you get an error on misspelled function names even if the test suite doesn't call them.
ru_ru: Установка этой переменной может пригодиться во время тестирования расширений, так как он гарантирует, что вы получите сообщение об ошибке на орфографическими ошибками имена функций, даже если набор тестов не называет их.

source: Setuid scripts have additional constraints that can produce error messages such as "Insecure dependency".
ru_ru: Setuid сценарии имеют дополнительные ограничения, которые могут производить сообщения об ошибках, такие как "небезопасная зависимость".

source: Since a2p usually picks correctness over efficiency.
ru_ru: С a2p обычно выбирает правильности над эффективностью.

source: Since it is an actual C<do> (not a C<require>), F<sitecustomize.pl> doesn't need to return a true value.
ru_ru: Поскольку это фактические C<do> (не C<require>), F<sitecustomize.pl> не нужно возвращать истинное значение.

source: Skip the real Pod formatting, and just show the raw Pod source (B<U>nformatted)
ru_ru: Игнорировать POD-форматирование и отобразить исходный код (B<U>nformatted)

source: So "perldoc intro" is enough to find/render "perlintro.pod".
ru_ru: Таким образом, "perldoc intro" достаточно, чтобы найти/сделать "perlintro.pod".

source: So C<my $logmessage = shift;> shifts the first item off the list of arguments and assigns it to C<$logmessage>.
ru_ru: So C<my $logmessage = shift;> двигает первый пункт из списка аргументов и присваивает его C<$logmessage>.

source: So by storing a reference as the value of an array or hash element, you can easily create lists and hashes within lists and hashes.
ru_ru: Так, сохраняя ссылку в качестве значения массива или хэша элемента, вы можете легко создавать списки и хэши внутри списков и хэшей.

source: So if you I<really> want a record separator of 0777, specify it as B<-0x1FF>.
ru_ru: Так что, если вы мне I<на самом> деле хотите разделитель записи 0777, указажите его как B<-0x1FF>.

source: So this is just a fancy way to copy files:
ru_ru: Так что это всего лишь причудливый способ для копирования файлов:

source: Some brief examples:
ru_ru: Некоторые краткие примеры:

source: Some documentation is not available as man pages, so if a cross-reference is not found by man, try it with L<perldoc>.
ru_ru: Некоторая документация не доступна в виде man страниц, так что, если перекрестные ссылки не найдены в мане, то попробуйте их с помощью L<perldoc>.

source: Some of these are specific to a particular platform.
ru_ru: Некоторые из них являются специфическими для конкретной платформы.

source: Some of the books we've listed appear almost ancient in internet scale, but we've included those books because they still describe the current way of doing things.
ru_ru: Некоторые из книг мы перечислили появляются чуть ли не древнее в интернете масштаба, но мы включили эти книги, потому что они по-прежнему описывают текущую способ делать вещи.

source: Some of the ones we've already seen include C<print>, C<sort> and C<reverse>.
ru_ru: Некоторые из них, которые мы уже видели, включают C<print>, C<sort> and C<reverse>.

source: Some of these books are available as free downloads.
ru_ru: Некоторые из этих книг доступны для бесплатной загрузки.

source: Some switches do care if they are processed twice, for instance combinations of B<-l> and B<-0>.
ru_ru: Некоторым ключам не все равно будут ли они обрабатываться дважды, например комбинации B<-l> и B<-0>.

source: Specified line by line via B<-e> or B<-E> switches on the command line.
ru_ru: Выполняется строка (однострочник), если в командной строке указаны параметры B<-e> или B<-E>.

source: Specify replacement for groff
ru_ru: Укажите замены для groff

source: Storage for the awk syntax tree is currently static, and can run out.
ru_ru: Память для синтаксического дерева AWK в настоящее время является статической, и может не хватить.

source: Styles and techniques will therefore differ, although some effort has been made to not vary styles too widely in the same sections.
ru_ru: Стили и методы будут таким образом отличаться, хотя некоторые усилия были предприняты, чтобы стили не менялись слишком широко в одном разделе.

source: Subroutines can also return values:
ru_ru: Подпрограммы могут также возвращать значения:

source: Switches in this variable are treated as if they were on every Perl command line.
ru_ru: Опции в этой переменной, рассматриваются как если бы они были на каждом Perl командной строки.

source: Switches include:
ru_ru: Переключатели (опции Switches) включают в себя:

source: The comma-separated list of options must follow a C<=> character.
ru_ru: Разделенный запятыми список опций должен следовать за символом C<=>.

source: The pattern may be surrounded by C<//>, C<"">, or C<''>, otherwise it will be put in single quotes.
ru_ru: Шаблон может быть окружен C<//>, C<"">, или C<''> в противном случае он будет поставлен в одинарные кавычки.

source: The value is considered space-separated.
ru_ru: Значение считается пробел.

source: The B<-C> flag controls some of the Perl Unicode features.
ru_ru: Флаг B<-C> указывает на некоторые из функций Perl Unicode.

source: The B<-X> option looks for an entry whose basename matches the name given on the command line in the file C<$Config{archlib}/pod.idx>.
ru_ru: Если присутствует параметр B<-X>, то будет использован индекс для поиска записи, чье имя совпадает с именем, полученным из командной строки в файле C<$config{archlib}/pod.idx>.

source: The B<-f> option followed by the name of a perl built-in function will extract the documentation of this function from L<perlfunc>.
ru_ru: Опция B<-f> вместе с названием встроенной Perl-функции позволяет получить документацию по этой функции из L<perlfunc>.

source: The B<-q> option takes a regular expression as an argument.
ru_ru: Опция B<-q> задает регулярное выражение в качестве аргумента,

source: The B<-v> option followed by the name of a Perl predefined variable will extract the documentation of this variable from L<perlvar>.
ru_ru: Ключ B<-v> с последующим названием Perl предопределенной переменной будет извлекать документацию этой переменной из L<perlvar>.

source: The B<-x> switch controls only the disposal of leading garbage.
ru_ru: Опция B<-x> управляет только сбросом ведущего мусор.

source: The C style for loop is rarely needed in Perl since Perl provides the more friendly list scanning C<foreach> loop.
ru_ru: Стиль С для цикла требуется редко Perl, т.к. Perl предоставляет более дружественный оператор для прохождения по списку C<foreach>.

source: The C<#!> line is always examined for switches as the line is being parsed.
ru_ru: Строка C<#!> всегда рассматривается для поиска переключателей, как строка, которая в настоящее время анализируется.

source: The C<//> matching operator is documented in L<perlop>.
ru_ru: Оператор соответствия C<//> описан в L<perlop>.

source: The C<< <> >> operator is most often seen in a C<while> loop:
ru_ru: Оператор C<< <> >> чаще всего используется в цикле C<while>:

source: The C<crlf> layer provides CRLF conversion as well as buffering.
ru_ru: C<crlf> CRLF слой обеспечивает преобразование а также буферизации.

source: The C<foreach> keyword is actually a synonym for the C<for> keyword.
ru_ru: Ключевое слово C<foreach> на самом деле является синонимом ключевое слова C<for>.

source: The C<io> options mean that any subsequent open() (or similar I/O operations) in the current file scope will have the C<:utf8> PerlIO layer implicitly applied to them, in other words, UTF-8 is expected from any input stream, and UTF-8 is produced to any output stream.
ru_ru: Опция C<io> означает, что любой последующий open() (или аналогичная операция ввода/вывода) в текущей области файла будет иметь C<:utf8> PerlIO слой неявно применяется к ним, другими словами, UTF-8, как ожидается, из любого входного потока и UTF-8 производится в любой выходной поток.

source: The C<my> is actually not required; you could just use:
ru_ru: C<my> на самом деле не требуется, вы можете использовать только:

source: The C<s///> substitution operator is documented in L<perlop>.
ru_ru: Оператор замены C<s///> описан в L<perlop>

source: The C<use diagnostics> pragma automatically turns Perl's normally terse warnings and errors into these longer forms.
ru_ru: Прагма C<use diagnostics> автоматически включается в Perl обычно краткие предупреждения и ошибки в длинные формы.

source: The C<use warnings> pragma produces some lovely diagnostics.
ru_ru: Прагма C<use warnings> сообщает некоторые замечательную диагностику.

source: The F<perldoc> program gives you access to all the documentation that comes with Perl.
ru_ru: F<perldoc> Программа дает вам доступ ко всей документации, которая поставляется с Perl.

source: The F<pod.idx> file should contain fully qualified filenames, one per line.
ru_ru: Файл F<pod.idx> должен содержать подходящие имена файлов, по одному имени на строке.

source: The PERL5DB environment variable is only used when Perl is started with a bare B<-d> switch.
ru_ru: PERL5DB переменная среды используется только при Perl запускается с голой B<-d> переключатель.

source: The PERLIO environment variable is completely ignored when Perl is run in taint mode.
ru_ru: Переменная PERLIO среда полностью игнорируется при Perl выполняется в данном режиме.

source: The PERLLIB environment variable is completely ignored when Perl is run in taint mode.
ru_ru: PERLLIB переменной окружения полностью игнорируется, когда Perl выполняется в данном режиме.

source: The Perl core uses a handful of keys in C<%^H> which do not follow this convention, because they predate it.
ru_ru: Ядро Perl использует несколько ключей в C<%^H>, которые не следуют этому соглашению, потому что они предшествуют его.

source: The Perl motto is "There's more than one way to do it." Divining how many more is left as an exercise to the reader.
ru_ru: Perl девиз: "Есть больше чем один способ сделать это." "There's more than one way to do it." Пророчества, сколько еще остается в качестве упражнения для читателя.

source: The Ram is a cookbook with hundreds of examples of using Perl to accomplish specific tasks:
ru_ru: Ram представляет собой сборник рецептов с сотнями примеров использования кода Perl для выполнения конкретных задач:

source: The Win95/NT installation, when using the ActiveState installer for Perl, will modify the Registry to associate the F<.pl> extension with the perl interpreter.
ru_ru: Win95/NT установки, когда используется ActiveState Perl установщик он изменяет реестр, чтобы связать расширение F<.pl> с интерпретатором Perl.

source: The actual code generated by B<-MI<MODULE>=foo,bar> is C<use module split(/,/,q{foo,bar})>.
ru_ru: Фактический код, генерируемый B<-MI<MODULE>=foo,bar> является C<use module split(/,/,q{foo,bar})>.

source: The behavior implied by the B<use warnings> pragma is not mandatory.
ru_ru: Поведение, подразумеваемое прагмой B<use warnings> не является обязательным.

source: The class must at least provide a C<parse_from_file> method.
ru_ru: Класс должен содержать метод C<parse_from_file>.

source: The code is executed I<very> early.
ru_ru: Код выполняется I<очень> рано.

source: The code is run in package C<main>, in its own lexical scope.
ru_ru: Код выполняется в пакете C<main>, в своей собственной лексической области.

source: The command used to load the debugger code.
ru_ru: Команда используется для загрузки кода отладчика.

source: The conditions can be any Perl expression.
ru_ru: Условием может быть любое Perl выражение.

source: The default argument to the C<shift> function just happens to be C<@_>.
ru_ru: Аргумент по умолчанию в C<shift> вытаскиеват первый аргумент массива C<@_>.

source: The default behaviour is to resolve symbols when they are used.
ru_ru: Поведение по умолчанию заключается в разрешении символы, когда они используются.

source: The default is:
ru_ru: Значение по умолчанию:

source: The default set of layers should give acceptable results on all platforms
ru_ru: По умолчанию набор слоев должны дать приемлемые результаты на всех платформах

source: The directory, if specified, must appear immediately following the B<-x> with no intervening whitespace.
ru_ru: Каталог, если указан, должен появиться сразу же после B<-x> без промежуточных пробелов.

source: The elements we're getting from the array start with a C<$> because we're getting just a single value out of the array; you ask for a scalar, you get a scalar.
ru_ru: Элементы, которые мы получаем из массива начинаются с C<$>, потому что мы получаем только одно значение из массива, вы запрашиваете в скалярном контексте и таким образом получаете скаляр.

source: The examples above use a relative path to the perl interpreter, getting whatever version is first in the user's path.
ru_ru: Приведенные выше примеры по использованию относительного пути к интерпретатору Perl, находят Perl в независимости от версии программы, которая встречается первой в пользовательских путях.

source: The exit statement in awk doesn't necessarily exit; it goes to the END block if there is one.
ru_ru: Для выхода из программы не обязательно ставить оператор EXIT, в AWK программа идет до конца блока, если он есть.

source: The extension, if supplied, is used to modify the name of the old file to make a backup copy, following these rules:
ru_ru: Расширение, если имеются, используется для изменения названия старых файлов, чтобы сделать резервную копию, следуя этим правилам:

source: The following example shows a 2 level hash of hash structure using anonymous hash references.
ru_ru: В следующем примере показаны 2 уровня хэш хэш-структуры с использованием анонимных ссылок на хэши.
